<a href="https://colab.research.google.com/github/initialvic3/common/blob/master/test_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
 import numpy as np
 import pandas as pd

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [ ]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Or data frames can be created from dicts (column: [data])

In [ ]:
df2.head()

   column1    column2  column3      D  E
0      1.0 2013-01-02      1.0   test  3
1      1.0 2013-01-02      1.0  train  3
2      1.0 2013-01-02      1.0   test  3
3      1.0 2013-01-02      1.0  train  3
4      1.0 2013-01-02      1.0   test  3

In [ ]:
df.tail()

                   A         B         C         D
2013-01-02  0.105539  0.078794  1.098312  1.113292
2013-01-03 -1.356984  1.244463 -0.626774 -0.825351
2013-01-04 -0.189933  0.522450  0.367692  0.033291
2013-01-05 -0.804062 -0.999743 -1.526051  0.205713
2013-01-06  0.185419  0.248440 -0.545958 -1.128638

In [ ]:
df2.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [ ]:
df2.columns

Index(['column1', 'column2', 'column3', 'D', 'E'], dtype='object')

In [ ]:
df.to_numpy()

array([[ 0.29230211,  1.79928569, -0.05123608, -1.20082378],
       [ 0.10553877,  0.07879448,  1.09831159,  1.11329245],
       [-1.35698442,  1.24446271, -0.62677443, -0.82535094],
       [-0.18993252,  0.52244955,  0.36769173,  0.03329123],
       [-0.8040621 , -0.999743  , -1.52605111,  0.20571257],
       [ 0.1854194 ,  0.24843996, -0.54595758, -1.12863843]])

In [ ]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'test', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'train', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'test', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'train', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'test', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'train', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'test', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'train', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'test', 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 'train', 3]],
      dtype=object)

In [ ]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.294620  0.482282 -0.214003 -0.300419
std    0.653322  0.972719  0.904331  0.909763
min   -1.356984 -0.999743 -1.526051 -1.200824
25%   -0.650530  0.121206 -0.606570 -1.052817
50%   -0.042197  0.385445 -0.298597 -0.396030
75%    0.165449  1.063959  0.262960  0.162607
max    0.292302  1.799286  1.098312  1.113292

In [ ]:
df.T.T

                   A         B         C         D
2013-01-01  0.292302  1.799286 -0.051236 -1.200824
2013-01-02  0.105539  0.078794  1.098312  1.113292
2013-01-03 -1.356984  1.244463 -0.626774 -0.825351
2013-01-04 -0.189933  0.522450  0.367692  0.033291
2013-01-05 -0.804062 -0.999743 -1.526051  0.205713
2013-01-06  0.185419  0.248440 -0.545958 -1.128638

In [ ]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.200824 -0.051236  1.799286  0.292302
2013-01-02  1.113292  1.098312  0.078794  0.105539
2013-01-03 -0.825351 -0.626774  1.244463 -1.356984
2013-01-04  0.033291  0.367692  0.522450 -0.189933
2013-01-05  0.205713 -1.526051 -0.999743 -0.804062
2013-01-06 -1.128638 -0.545958  0.248440  0.185419

In [ ]:
df.sort_values(by="B",ascending=True)

                   A         B         C         D
2013-01-05 -0.804062 -0.999743 -1.526051  0.205713
2013-01-02  0.105539  0.078794  1.098312  1.113292
2013-01-06  0.185419  0.248440 -0.545958 -1.128638
2013-01-04 -0.189933  0.522450  0.367692  0.033291
2013-01-03 -1.356984  1.244463 -0.626774 -0.825351
2013-01-01  0.292302  1.799286 -0.051236 -1.200824

In [ ]:
df.A

2013-01-01    0.292302
2013-01-02    0.105539
2013-01-03   -1.356984
2013-01-04   -0.189933
2013-01-05   -0.804062
2013-01-06    0.185419
Freq: D, Name: A, dtype: float64

In [ ]:
df.B

2013-01-01    1.799286
2013-01-02    0.078794
2013-01-03    1.244463
2013-01-04    0.522450
2013-01-05   -0.999743
2013-01-06    0.248440
Freq: D, Name: B, dtype: float64

In [ ]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.105539  0.078794  1.098312  1.113292
2013-01-03 -1.356984  1.244463 -0.626774 -0.825351
2013-01-04 -0.189933  0.522450  0.367692  0.033291

In [ ]:
df[:2]

                   A         B         C         D
2013-01-01  0.292302  1.799286 -0.051236 -1.200824
2013-01-02  0.105539  0.078794  1.098312  1.113292

In [ ]:
df.loc[dates[0]]

A    0.292302
B    1.799286
C   -0.051236
D   -1.200824
Name: 2013-01-01 00:00:00, dtype: float64

In [ ]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.292302  1.799286
2013-01-02  0.105539  0.078794
2013-01-03 -1.356984  1.244463
2013-01-04 -0.189933  0.522450
2013-01-05 -0.804062 -0.999743
2013-01-06  0.185419  0.248440

In [ ]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.105539  0.078794
2013-01-03 -1.356984  1.244463
2013-01-04 -0.189933  0.522450

In [ ]:
df.loc["20130102", ["A", "B"]]

A    0.105539
B    0.078794
Name: 2013-01-02 00:00:00, dtype: float64

In [ ]:
df.loc[dates[0], "A"]

0.29230211388578253

In [ ]:
df.at[dates[0], "A"]

0.29230211388578253

In [ ]:
df.iat[0,0]

0.29230211388578253

In [ ]:
df

                   A         B         C         D
2013-01-01  0.292302  1.799286 -0.051236 -1.200824
2013-01-02  0.105539  0.078794  1.098312  1.113292
2013-01-03 -1.356984  1.244463 -0.626774 -0.825351
2013-01-04 -0.189933  0.522450  0.367692  0.033291
2013-01-05 -0.804062 -0.999743 -1.526051  0.205713
2013-01-06  0.185419  0.248440 -0.545958 -1.128638

In [ ]:
df.iloc[3]

A   -0.189933
B    0.522450
C    0.367692
D    0.033291
Name: 2013-01-04 00:00:00, dtype: float64

In [ ]:
df.iloc[:,3]

2013-01-01   -1.200824
2013-01-02    1.113292
2013-01-03   -0.825351
2013-01-04    0.033291
2013-01-05    0.205713
2013-01-06   -1.128638
Freq: D, Name: D, dtype: float64

In [ ]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.799286 -0.051236
2013-01-02  0.078794  1.098312
2013-01-03  1.244463 -0.626774
2013-01-04  0.522450  0.367692
2013-01-05 -0.999743 -1.526051
2013-01-06  0.248440 -0.545958

In [ ]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.292302  1.799286 -0.051236 -1.200824
2013-01-02  0.105539  0.078794  1.098312  1.113292
2013-01-06  0.185419  0.248440 -0.545958 -1.128638

In [ ]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.292302  1.799286       NaN       NaN
2013-01-02  0.105539  0.078794  1.098312  1.113292
2013-01-03       NaN  1.244463       NaN       NaN
2013-01-04       NaN  0.522450  0.367692  0.033291
2013-01-05       NaN       NaN       NaN  0.205713
2013-01-06  0.185419  0.248440       NaN       NaN

In [ ]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.292302  1.799286 -0.051236 -1.200824    one
2013-01-02  0.105539  0.078794  1.098312  1.113292    one
2013-01-03 -1.356984  1.244463 -0.626774 -0.825351    two
2013-01-04 -0.189933  0.522450  0.367692  0.033291  three
2013-01-05 -0.804062 -0.999743 -1.526051  0.205713   four
2013-01-06  0.185419  0.248440 -0.545958 -1.128638  three

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.449915 -1.168751 -0.339933  0.349806
1  0.297284  1.118756  1.173569  0.242527
2 -0.441951 -1.137584 -0.942504  0.552556
3 -0.445185 -0.034156 -0.683534 -1.683099
4  0.289433  1.614730  0.566001 -0.885806
5 -0.421027  0.527782 -0.454291 -0.583930
6 -0.796555 -0.058822 -0.649653 -1.627883
7 -0.900308  0.461032 -1.412980  0.961134
8  1.274750 -0.603258 -0.269273  2.057538
9  2.152933 -0.297487  0.613498 -1.622716

In [ ]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.449915 -1.168751 -0.339933  0.349806
 1  0.297284  1.118756  1.173569  0.242527
 2 -0.441951 -1.137584 -0.942504  0.552556,
           0         1         2         3
 3 -0.445185 -0.034156 -0.683534 -1.683099
 4  0.289433  1.614730  0.566001 -0.885806
 5 -0.421027  0.527782 -0.454291 -0.583930
 6 -0.796555 -0.058822 -0.649653 -1.627883,
           0         1         2         3
 7 -0.900308  0.461032 -1.412980  0.961134
 8  1.274750 -0.603258 -0.269273  2.057538
 9  2.152933 -0.297487  0.613498 -1.622716]

In [ ]:
pd.concat(pieces)

          0         1         2         3
0 -0.449915 -1.168751 -0.339933  0.349806
1  0.297284  1.118756  1.173569  0.242527
2 -0.441951 -1.137584 -0.942504  0.552556
3 -0.445185 -0.034156 -0.683534 -1.683099
4  0.289433  1.614730  0.566001 -0.885806
5 -0.421027  0.527782 -0.454291 -0.583930
6 -0.796555 -0.058822 -0.649653 -1.627883
7 -0.900308  0.461032 -1.412980  0.961134
8  1.274750 -0.603258 -0.269273  2.057538
9  2.152933 -0.297487  0.613498 -1.622716

In [ ]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [ ]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [ ]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [ ]:
df = pd.DataFrame(
  {
      "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
      "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
      "C": np.random.randn(8),
      "D": np.random.randn(8),
  }
)
df

     A      B         C         D
0  foo    one  0.726729 -0.212860
1  bar    one  0.204271 -2.144368
2  foo    two -1.262413  0.353569
3  bar  three -0.124210 -0.142271
4  foo    two -0.469268  1.647064
5  bar    two  2.320646 -0.576361
6  foo    one -0.111091  1.460911
7  foo  three  0.714736  0.187139